detailed_work_experience/work_exp.org
#+TITLE: Detailed Work Experience
#+AUTHOR: Tarak Kharrat
#+OPTIONS: toc:nil
#+LaTeX_HEADER: \usepackage[x11names]{xcolor}
#+LaTeX_HEADER: \hypersetup{linktoc = all, colorlinks = true, urlcolor = olive, citecolor = blue, linkcolor = black}

#+begin_abstract
In this document, I give a detailed overview of my work experience. It is
meant to complement [[https://liverpool.academia.edu/TarakKharrat/CurriculumVitae][my short resume]], giving the reader more information
about the type of projects I have been involved in, and the
tools I have built during my career.
#+end_abstract

#+LATEX: \tableofcontents \clearpage

* Overview
I am a data scientist with extensive experience of building **predictive
models** in competitive commercial environments. I have an undergraduate degree
in pure mathematics, a masters degree in quantitative finance and a PhD in
statistics. Over the past 10 years, I have been working with data on a daily
basis and developed a set of tools that allows me to help any business
interested in making predictions.

* Academia
After finishing my PhD in October 2015, I have been working as a (part-time)
research fellow contributing to research papers in the field of computational
statistics and sports analytics.

Although I like developing new methodologies in my research, I am keen to
demonstrate new methodologies in a practical setting. Therefore, my papers
either solve a real life problem or develop some new methodology to solve an
existing problem. For example, the new family of counting processes described in
cite:baker2018event and the associated software cite:kharrat2019flexible were
motivated by the restrictive assumptions of the Poisson model systematically
applied in the football forecasting literature. Thus, in
cite:boshnakov2017bivariate we argued that the application of the new
methodology (the renewal counting processes) gave a better prediction than the
benchmark (the Poisson model and its derivatives).

In my academic journey, I have had the opportunity to collaborate with world class
researchers from the United Kingdom and Canada and published papers in top
journals. My full list of publication can be found below: 
+ *Applied mathematics*: cite:heil2012quasi
+ *Computational statistics*: cite:baker2018event,kharrat2019flexible  
+ *Sports analytics*: cite:boshnakov2017bivariate,kharrat2019plus and
  cite:kharrat20deep
* Industry
** Trading (finance)
   I started on the trading floor in April 2011 as an intern within the
   proprietary trading department of /Societe Generale/ Paris before moving to New
   York in July 2011 as a full time employee.

   The main focus of my job was to use quantitative tools and data to help
   traders find alphas and design/refine semi or fully automated trading
   strategies. I collaborated closely with the high frequency and basket trading
   desks and worked mainly on the US Equity and Future markets (S&P500, Russell
   1000 and to some extent Nasdaq).

   The standard workflow usually begins with ideas/observations coming from the
   traders. I worked together with them on refining these ideas, transforming
   them into hypotheses to be tested using data. 

   The choice of the training data is vital for the success of such tasks and
   hence I used the traders expertise to carefully define the data samples
   before starting any modelling. In particular, special attention was given to
   check that the data generation process was likely to be similar (between our
   training data points and the future trading points). In other words, we had to
   carefully pick up (enough) data points from the past where market conditions
   were likely to be similar to current (and near future) market conditions.

   Although details on the strategies cannot be fully disclosed here, I was
   mainly working on two major subjects: stocks correlation within an index and
   stock likelihood to join or leave an index (index re-balancing). I also
   worked occasionally on some ideas related to special events (mainly M&A)
   where we tried to estimate the probability of a deal to move from /announced/
   to /agreed/ or from /completed/ to /terminated/.
** Betting (football)
   The betting market offers a solid benchmark for anyone trying to forecast the
   outcome of a football match. Although one of my papers cite:boshnakov2017bivariate
   discussed this problem, I really started to properly look at this subject
   when I started my collaboration with Kickdex in late 2015. The mission was
   complex but clearly defined: building (from scratch) an accurate predictive
   model able to generate profit when used in an automated (algorithmic) betting
   strategy on the Asian market.

   It took us slightly less than 4 years to reach that goal but it was a very
   enriching experience where I learned a lot about how predictive models work,
   how to improve them, interpret their errors and communicate research findings
   to non-technical domain experts. I also had the opportunity to work alongside
   very talented quants and IT experts who taught me a lot on daily basis.

   In the rest of this section, I describe in more detail the steps we followed
   to build our cutting-edge advanced model:
*** Identify the appropriate data sources
    The main feed provider used by Kickdex is [[https://www.optasports.com/][Opta]]. The choice of the provider
    was a business decision made at the investors' level and hence changing it
    would require building a strong case.

    The first decision we subsequently had to make was how to store the data.
    ~MongoDB~, a ~non-SQL~ type database, was selected. The dataset was very
    unstructured and after consulting with the IT team the choice of ~mongoDB~
    was straightforward.

    The second step was to define a set of tests to apply to raw feed when
    received from the provider to ensure that every (game) feed entering the
    database is trustworthy. These tests check various properties of the data
    such as validity (11 players on the pitch, every player on the team sheet
    has at least one event associated to him,... ), consistency (same id used to
    identify the same player,...) and absence of outliers (no games with a very
    high number of specific events such as shots for example). We were able
    using this process to flag corrupted games and report them to the provider
    asking for corrections when possible. At the end of this step, we were
    confident that every data point (a document in the ~mongoDB~ terminology)
    could be used for modelling.

    We also identified a number of websites containing complementary
    information. The websites were found based on expert advise, from academic
    papers or from specialised forums. Once selected, the feed was extracted by
    web-scraping, cleaned, validated (using the same logic described above) and
    then mapped to the Opta feed and stored in our database.

*** Defining the right metric to evaluate a set of probabilities
    With a valid dataset in hand, the next step was to define a method to
    evaluate the /quality/ of a set of predictions i.e. probabilities produced
    for unseen games. The method had to be adapted to our application (the
    property of our betting strategy), and should have attractive mathematical
    properties (for example being a proper scoring rule). After studying what
    has been suggested in the literature, we found out that the ideas discussed
    in cite:johnstone11_tailor_scorin_rules_probab were the more relevant for
    our objective and adapted them to build a /Kickdex proper scoring rule/.
