detailed_work_experience/work_exp.org
*** Feature engineering
    Features are the fuel of predictive models and hence feeding good features
    into a model has a dramatic impact on its performance. Designing (good)
    features is more of an art than a scientific process and relies heavily on
    domain knowledge and the available data. We collected ideas (inspiration)
    from academic papers, specialised forums and discussion with professional
    punters to create our feature set. We carefully checked that our features
    did not include future information (also known as /look-ahead bias/) and
    tried carefully to avoid any systematic bias. We also tried to diversify our
    feature set as much as possible to capture the complexity of a football
    game. It is worth noting that a feature set is usually dynamic: new features
    get introduced regularly whilst others are rejected as the result of new
    research and development.

*** Feature selection
    It is often the case when working with features to end up having a large
    pool of candidates to test. This usually happens because you may have
    designed several small variations of the same idea or because you wanted to
    capture different aspect of the game. Although some models can select
    features at the fitting/training step, others can fail to converge when
    presented with highly correlated features (linear models for example). Even
    if the model used is robust to highly correlated features, it is usually a
    bad idea to pass a large feature set as it will increase dramatically the
    time needed for training. Therefore, using a filter to keep only the
    relevant information is a crucial task when building a predictive model.

    At Kickdex, we conducted extensive research on the subject and tested
    different approaches based on clustering, feature mirroring, .... We ended
    up building a propriety feature selection process that proved to be useful
    and allowed us to reduce the size of our set from several thousand features
    initially to less than 50.
*** Feeding the right features to the right learners
    It is important to know how the feature values are going to be digested by a
    specific learner (i.e model) and it is sometimes useful to transform a
    feature before passing it. For example, models that estimates parameters by
    numerically minimising a loss function may benefit from features being on
    the same scale (neural networks are one family of such models).

    At Kickdex, we spent time trying different transformations and how they
    performed when associated with specific learners. We built good
    understanding on what combinations work best and leveraged that when
    building our final model.

*** Combining the successful learners
    After trying several modelling approaches, we came to the conclusion that no
    single model is likely to outperform all the others for the different type
    of markets we wanted to predict. Therefore, we decided to combine different
    type of learners using different sets of features to build an ensemble. The
    hope was that the sub-models would commit different type of errors (ideally
    uncorrelated) and hence combining them will result in better predictions
    (than the best sub model in the ensemble).

    We designed a framework to train/test an ensemble of arbitrarily selected
    base learners on generic classification tasks using ideas presented in
    cite:caruana04_ensem. We leveraged cloud computing power to test the
    performance of a candidate model on real data. After some code optimisation
    and careful redesign, we managed to reduce the training time from a few
    weeks to less than 10 hours for the current version used in production.
*** Explaining the predictions
    Although our ensemble can be seen as a type of /black box/ model, we
    attached specific care to its interpretability and tried as much as possible
    to explain its prediction. Using tools such as the ~DALEX~ package
    cite:dalex2018, we tried to understand how the predictions changed with
    changes in feature values and for given prediction scenarios (usually when
    the model is far from the benchmark i.e the betting market) which features
    were responsible for the estimated probability. This approach allowed us
    first to build confidence on our predictions and second to get some useful
    feedback to improve the model by designing new features.

*** Back-testing the betting strategy
    Back-testing a betting strategy is a very complicated task for several reasons: 
    + It is hard to get reliable historical prices with an accurate time-stamp. 
    + It is hard to model market impact or whether a bet will be accepted or not. 
    + Liquidity information is not available i.e. you don't know how much is
      available to bet on at the advertised price.
    + The market is rapidly changing: new players coming in, others disappearing
      ...
    
    Therefore, we decided at Kickdex to only use the market prices as a
    benchmark and focused on improving our probability (in terms of our tailored
    in-house probability score) as much as possible. Nevertheless, we still
    simulate betting strategies on unseen data (usually we leave the most recent couple of
    seasons for validation) just to get an order of magnitude of our expected
    return on investment and the Sharpe ratio. However, we never used these metrics
    as targets to optimise in our modelling process.
*** Deploying the model in production
    All our models were deployed on Amazon Web Services (AWS) and we spent a lot
    of energy working with the IT team to make transition from prototyping to
    testing and from testing to production as smooth as possible. We leveraged
    tools such as ~conda~ and ~docker~ and made sure all the prototyping work was
    made already in a copy of the production environment to avoid dealing with
    version clashes or any other dependency issues.
*** Monitoring trading performance
    We developed automated tools to monitor the trading performance of our
    production model. In particular, we tried to check if the live performance
    was in line with the historical performance and to detect any change point
    in the feature distribution, the probability score distribution .... These
    tools allowed us to act quickly when an issue was detected and hence to
    avoid unexpected losses that could dramatically damage the return of our
    strategy.
