detailed_work_experience/work_exp.org
** Consultancy
   Driven by the desire to apply my research to real life industrial problems, I
   have always been keen to collaborate with the industry during my academic
   career. Below are some examples of collaborations I recently did:

   + Between 2008 and 2010, I worked with [[https://www.total.com/en/group/identity][TOTAL]] to define systematic tests to
     one of their software (STAGE) responsible for the optimisation of the
     number of ships required to ensure a smooth transportation of LNG between
     loading and unloading terminals across the world. I helped discovering some
     bugs and suggested some optimisation to version 6.1.10.
   + My research paper cite:heil2012quasi found a real life application at
     [[https://www.thalesgroup.com/en][THALES]].
   + In 2013, together with two colleagues from the maths department at the
     University of Manchester, we helped [[https://www.bet365.com/#/HO/][bet365]] fix some bias in their pre-match
     pricing model for lower tier football leagues in Europe.
   + I helped the UK atomic weapons establishment in 2014 to solve non-Gaussian
     dynamic regression problems and implemented an R package for them to apply
     it on their (confidential) data.
   + An optimised version of the model described in cite:boshnakov2017bivariate
     was adapted to build some learners used by the ensemble model we deployed
     in production at Kickdex since 2015.
   + I co-designed the sports analytics Machine (SAM) used by the BBC from 2015
     until 2018 to analyse football matches, rate players and estimate the
     likely impact of new signings in football.
   + A lawyer house used some of the football player ratings system I created
     cite:kharrat20deep,kharrat2019plus in 2018 to build a case against a
     football club on the behalf of a young professional player claiming some
     compensation for a long term injury suffered during a game against that
     club.
   + I helped L'Oreal in 2019 to improve their customer suggestion tool by
     reviewing their modelling process and optimising its predictive power which
     substantially increased their conversion rate (visit to purchase) by 13%.
* Toolbox
** Machine learning (ML) and Artificial Intelligence (AI)
   + I have a good understanding of the main ML models for supervised
     (classification, regression) and unsupervised (clustering) learning. I have
     experience with the most popular algorithms and I have been using them
     regularly over the past 6 years.
   + Solid experience in deep learning, its main framework ~tensorflow/keras~
     and ~pytorch/fastai~, and its applications (computer vision, natural
     language processing, tabular data ...).
   + Good knowledge of (deep) reinforcement learning. See also
     cite:kharrat20deep.
** Programming languages
*** R
    R has become my go to programming language whenever I want to code
    something. I have been using it almost daily over the past 10 years and I
    managed to build a powerful toolbox that would allow me to do most 
    data-related tasks. I am the author or co-author of more than 50 packages
    (just a couple of them available on the public domain).
    
    Some of the tasks I did in R are briefly described below:
    + Packages implementing some predictive models based on the renewal counting
      process or adaptation of some survival models.
    + I created ~RESTful~ API using the ~plumber~ package to expose some of my
      models.
    + I created more than six scrapers (all running in production) using the
      ~rvest~, ~httr~ or ~Rselenium~ ecosystem.
    + I extended the ~mongoDB~ R driver (~mongolite~) in my ~mongoTools~ package.
    + I am very familiar with the machine learning ecosystem in R namely ~mlr~
      (and its successor ~mlr3~) and ~caret~ (and its successor ~tidymodels~).
    + Working experience with the time series tools (~forecast~, ~KFAS~, ..) 
    + Solid experience bridging R with other languages such as python
      (~reticulate~, ~rpy2~) and C++ (~Rcpp~)
    + Good working experience with deep learning frameworks such as ~tensorflow~
      or ~keras~ in R (although for deep learning I prefer using python).
    + Some experience with the main visualisation tools such ~ggplot2~ and
      ~shiny~.
*** python
    Most of our code at Kickdex is written in python and hence I contributed to
    several internal modules. I am not as advanced in Python as I am in R but I
    have developed:
    + Good understanding of core python library and fundamental concepts.
    + Some working experience with data science tools such as ~numpy~, ~pandas~
      and ~scikit-learn~.
    + Solid experience with deep learning frameworks such as ~tensorflow/keras~
      and ~pytorch/fastai~.
    + I am able to write production ready code but maybe not as fast as I would
      be in R.
*** C++
    The first programming language I learned is C/C++. I was using it regularly
    between 2008 and 2011 but slowly switched to scripting languages over the
    past five years. Some of the projects I did in C++ are:
    + Most of the code I wrote when working for /Societe Generale/ was in C++.
    + I implemented the Helmholtz module in [[http://oomph-lib.maths.man.ac.uk/doc/html/index.html][oomph-lib]] cite:heil2006oomph.
    + My R package [[https://cran.r-project.org/web/packages/Countr/index.html][Countr]] cite:kharrat2019flexible is mostly written in C++ and
      then bridged to R using ~Rcpp~ cite:Eddelbuettel2017rcpp.
*** julia
  I am a big fan and early adopter of [[https://julialang.org/][julia]] and I started using it in
  prototyping work. However, due to its short history, I didn't use it in
  production yet.
** Database technology
   I have more than 5 years experience with ~mongoDB~ in production. However, I
   have only limited experience with other type of database technology such as
   ~SQL~ or ~Casandra~ ...
** Operating System
   I have very good working knowledge (more than 8 years) with Unix type
   operating systems (mainly Ubuntu and ~redhat~ Scientific Linux).
** Cloud computing and model deployment
   + I have been writing production ready code over the past 4 years mainly in R
     and Python.
   + Good knowledge of version control tools (~git~).
   + Good experience with dependency management system such as ~conda~ and ~docker~.
   + Some experience training complex models in the cloud (mainly Google cloud
     and to some extent AWS) or on internal clusters.

bibliographystyle:apalike
bibliography:~/Bibliography/references.bib
