detailed_work_experience/work_exp.tex
\subsection{Consultancy}
\label{sec:org81fef6a}
Driven by the desire to apply my research to real life industrial problems, I
have always been keen to collaborate with the industry during my academic
career. Below are some examples of collaborations I recently did:

\begin{itemize}
\item Between 2008 and 2010, I worked with \href{https://www.total.com/en/group/identity}{TOTAL} to define systematic tests to
one of their software (STAGE) responsible for the optimisation of the
number of ships required to ensure a smooth transportation of LNG between
loading and unloading terminals across the world. I helped discovering some
bugs and suggested some optimisation to version 6.1.10.
\item My research paper \cite{heil2012quasi} found a real life application at
\href{https://www.thalesgroup.com/en}{THALES}.
\item In 2013, together with two colleagues from the maths department at the
University of Manchester, we helped \href{https://www.bet365.com/\#/HO/}{bet365} fix some bias in their pre-match
pricing model for lower tier football leagues in Europe.
\item I helped the UK atomic weapons establishment in 2014 to solve non-Gaussian
dynamic regression problems and implemented an R package for them to apply
it on their (confidential) data.
\item An optimised version of the model described in \cite{boshnakov2017bivariate}
was adapted to build some learners used by the ensemble model we deployed
in production at Kickdex since 2015.
\item I co-designed the sports analytics Machine (SAM) used by the BBC from 2015
until 2018 to analyse football matches, rate players and estimate the
likely impact of new signings in football.
\item A lawyer house used some of the football player ratings system I created
\cite{kharrat20deep,kharrat2019plus} in 2018 to build a case against a
football club on the behalf of a young professional player claiming some
compensation for a long term injury suffered during a game against that
club.
\item I helped L'Oreal in 2019 to improve their customer suggestion tool by
reviewing their modelling process and optimising its predictive power which
substantially increased their conversion rate (visit to purchase) by 13\%.
\end{itemize}
\section{Toolbox}
\label{sec:org6e35dc1}
\subsection{Machine learning (ML) and Artificial Intelligence (AI)}
\label{sec:org18a0572}
\begin{itemize}
\item I have a good understanding of the main ML models for supervised
(classification, regression) and unsupervised (clustering) learning. I have
experience with the most popular algorithms and I have been using them
regularly over the past 6 years.
\item Solid experience in deep learning, its main framework \texttt{tensorflow/keras}
and \texttt{pytorch/fastai}, and its applications (computer vision, natural
language processing, tabular data \ldots{}).
\item Good knowledge of (deep) reinforcement learning. See also
\cite{kharrat20deep}.
\end{itemize}
\subsection{Programming languages}
\label{sec:orgf1ce182}
\subsubsection{R}
\label{sec:org2b3e36f}
R has become my go to programming language whenever I want to code
something. I have been using it almost daily over the past 10 years and I
managed to build a powerful toolbox that would allow me to do most 
data-related tasks. I am the author or co-author of more than 50 packages
(just a couple of them available on the public domain).

Some of the tasks I did in R are briefly described below:
\begin{itemize}
\item Packages implementing some predictive models based on the renewal counting
process or adaptation of some survival models.
\item I created \texttt{RESTful} API using the \texttt{plumber} package to expose some of my
models.
\item I created more than six scrapers (all running in production) using the
\texttt{rvest}, \texttt{httr} or \texttt{Rselenium} ecosystem.
\item I extended the \texttt{mongoDB} R driver (\texttt{mongolite}) in my \texttt{mongoTools} package.
\item I am very familiar with the machine learning ecosystem in R namely \texttt{mlr}
(and its successor \texttt{mlr3}) and \texttt{caret} (and its successor \texttt{tidymodels}).
\item Working experience with the time series tools (\texttt{forecast}, \texttt{KFAS}, ..)
\item Solid experience bridging R with other languages such as python
(\texttt{reticulate}, \texttt{rpy2}) and C++ (\texttt{Rcpp})
\item Good working experience with deep learning frameworks such as \texttt{tensorflow}
or \texttt{keras} in R (although for deep learning I prefer using python).
\item Some experience with the main visualisation tools such \texttt{ggplot2} and
\texttt{shiny}.
\end{itemize}
\subsubsection{python}
\label{sec:org8ec856f}
Most of our code at Kickdex is written in python and hence I contributed to
several internal modules. I am not as advanced in Python as I am in R but I
have developed:
\begin{itemize}
\item Good understanding of core python library and fundamental concepts.
\item Some working experience with data science tools such as \texttt{numpy}, \texttt{pandas}
and \texttt{scikit-learn}.
\item Solid experience with deep learning frameworks such as \texttt{tensorflow/keras}
and \texttt{pytorch/fastai}.
\item I am able to write production ready code but maybe not as fast as I would
be in R.
\end{itemize}
\subsubsection{C++}
\label{sec:org3cc3ba3}
The first programming language I learned is C/C++. I was using it regularly
between 2008 and 2011 but slowly switched to scripting languages over the
past five years. Some of the projects I did in C++ are:
\begin{itemize}
\item Most of the code I wrote when working for \emph{Societe Generale} was in C++.
\item I implemented the Helmholtz module in \href{http://oomph-lib.maths.man.ac.uk/doc/html/index.html}{oomph-lib} \cite{heil2006oomph}.
\item My R package \href{https://cran.r-project.org/web/packages/Countr/index.html}{Countr} \cite{kharrat2019flexible} is mostly written in C++ and
then bridged to R using \texttt{Rcpp} \cite{Eddelbuettel2017rcpp}.
\end{itemize}
\subsubsection{julia}
\label{sec:org73383cd}
I am a big fan and early adopter of \href{https://julialang.org/}{julia} and I started using it in
prototyping work. However, due to its short history, I didn't use it in
production yet.
\subsection{Database technology}
\label{sec:org45d83cd}
I have more than 5 years experience with \texttt{mongoDB} in production. However, I
have only limited experience with other type of database technology such as
\texttt{SQL} or \texttt{Casandra} \ldots{}
\subsection{Operating System}
\label{sec:org814a58d}
I have very good working knowledge (more than 8 years) with Unix type
operating systems (mainly Ubuntu and \texttt{redhat} Scientific Linux).
\subsection{Cloud computing and model deployment}
\label{sec:org8a1fcbe}
\begin{itemize}
\item I have been writing production ready code over the past 4 years mainly in R
and Python.
\item Good knowledge of version control tools (\texttt{git}).
\item Good experience with dependency management system such as \texttt{conda} and \texttt{docker}.
\item Some experience training complex models in the cloud (mainly Google cloud
and to some extent AWS) or on internal clusters.
\end{itemize}

\bibliographystyle{apalike}
\bibliography{../../../Software/spacemacs/Bibliography/references}
\end{document}